Tekla.Structures.Model.BoltGroup.BoltThreadInMaterialEnum
The thread in the material.

Tekla.Structures.Model.BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO
No thread inside the material (the part).

Tekla.Structures.Model.BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_YES
Thread inside the material (the part).